Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 21/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:transactionSearchCriteria>
         <!--Optional:-->
 <tran:searchType>IN</tran:searchType>
         <tran:customerID>100021</tran:customerID>
         <!--Optional:-->
         <tran:fromDate>2007-02-25</tran:fromDate>
         <tran:toDate>2009-09-19</tran:toDate>
         <tran:limitOfResults>1</tran:limitOfResults>
       
         <!--Optional:-->
         <tran:partnerFunctionList>
            <!--1 or more repetitions:-->
            <tran:partnerFunction>PARTNER_FUNCTION_BILLTO</tran:partnerFunction>
	<tran:partnerFunction>PARTNER_FUNCTION_SHIPTO</tran:partnerFunction>
	<tran:partnerFunction>PARTNER_FUNCTION_SOLDTO</tran:partnerFunction>
         </tran:partnerFunctionList>
      </tran:transactionSearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>